# Brew bundle for workstation setup

# Core
brew "git"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "gh"
brew "jq"
brew "zoxide"
brew "tmux"
brew "neovim"
brew "difftastic"
brew "ast-grep"

# Node
brew "nvm"

# Fonts
cask "font-jetbrains-mono"

# Terminal + utilities
cask "kitty"
cask "obsidian"

# Optional (uncomment as needed)
# brew "wget"
# cask "raycast"
# cask "google-chrome"
